# Data Cleaning and Merging Part 1

## This script contains the following points:

1. Import libraries and customer dataframe.

2. Data wrangling procedures for consistency, e.g. renaming columns.

3. Fundamental data quality and consistency checks, e.g. checking for and addressing missing values.

4. Combine customer data with the remaining prepared Instacart data.

5. Export combined dataframe as pickle file.

## 1. Import libraries and customer dataframe

In [1]:
# Import libraries.

import pandas as pd
import numpy as np
import os

In [2]:
#Turn project folder path into a string.

path = r'C:\Users\danie\Desktop\CareerFoundry\Achievement 4-Python\11-2023 Instacart Basket Analysis'
path

'C:\\Users\\danie\\Desktop\\CareerFoundry\\Achievement 4-Python\\11-2023 Instacart Basket Analysis'

In [3]:
# Import customer data set.

df_customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

## 2. Data wrangling procedures for consistency

In [4]:
# Explore df_customer basic information.

df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [5]:
# Examine df_customer column names.

df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Rename "Surnam" variable as "last_name" and "First Name," "Gender," "STATE," and "Age" columns to match capitalization formatting in remaining columns.

df_customer.rename(columns = {'Surnam':'last_name','First Name':'first_name', 'Gender':'gender', 'STATE':'state', 'Age':'age'}, inplace = True)

In [7]:
# Check column name changes.

df_customer.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
# Change user_id data type from int64 to string.

df_customer['user_id'] = df_customer['user_id'].astype('str')

In [9]:
# Check user_id data type change.

df_customer['user_id'].dtype

dtype('O')

## 3. Fundamental data quality and consistency checks

In [10]:
# Search df_customer for mixed-type columns.

for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].map(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

first_name

In [12]:
# Change first_name data type from mixed-type to string.

df_customer['first_name'] = df_customer['first_name'].astype('str')

In [13]:
# Check first_name data type change.

df_customer['first_name'].dtype

dtype('O')

In [15]:
# Search for missing values.

df_customer.isnull().sum()

user_id         0
first_name      0
last_name       0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [16]:
# Search for duplicates.

df_dups = df_customer.duplicated()

In [17]:
df_dups

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [29]:
# Check descriptive statistics on quantitative variables (age, n_dependants, income).

df_customer.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [30]:
# Check value counts for gender variable.

df_customer['gender'].value_counts(dropna = False)

gender
Male      104067
Female    102142
Name: count, dtype: int64

In [33]:
# Check number of unique values for state variable.

df_customer['state'].nunique()

51

In [31]:
# Check value counts for state variable.

df_customer['state'].value_counts(dropna = False)

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

District of Columbia is included in the value counts for state variable, which explains the 51 unique values in the state column despite 50 US states.

In [34]:
# Check for minimum date_joined.

df_customer['date_joined'].min()

'1/1/2017'

In [35]:
# Check for maximum date_joined.

df_customer['date_joined'].max()

'9/9/2019'

In [36]:
# Check value counts for n_dependants.

df_customer['n_dependants'].value_counts(dropna = False)

n_dependants
0    51602
3    51594
1    51531
2    51482
Name: count, dtype: int64

In [37]:
# Check value counts for fam_status variable.

df_customer['fam_status'].value_counts(dropna = False)

fam_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [40]:
# Print median for income variable.

df_customer['income'].median()

93547.0

In [42]:
# Print minimum for income variable.

df_customer['income'].min()

25903

In [43]:
# Print maximum for income variable.

df_customer['income'].max()

593901

In [44]:
# Check value counts for income variable.

df_customer['income'].value_counts(dropna = False)

income
57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: count, Length: 108012, dtype: int64

In [45]:
# Check for validity of incomes > 300000.

df_check_income = df_customer[df_customer['income'] > 300000]

In [46]:
df_check_income.sort_values(by='income', ascending=True, )

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
979,200930,Charles,Nichols,Male,South Carolina,60,1/6/2017,1,married,300913
86870,71498,Gloria,Stafford,Female,Virginia,69,5/14/2018,3,married,302234
138764,151552,Mark,Neal,Male,Oklahoma,71,3/11/2019,1,married,302363
47787,205650,Jeremy,Vang,Male,Kentucky,62,10/2/2017,0,divorced/widowed,302526
58395,77541,Kimberly,Anderson,Female,Montana,25,12/3/2017,2,married,302561
...,...,...,...,...,...,...,...,...,...,...
167037,189861,Pamela,Jordan,Female,Pennsylvania,47,8/21/2019,0,single,584097
111950,187680,Catherine,Church,Female,Wyoming,43,10/7/2018,2,married,590790
81583,103702,Kathryn,Mclaughlin,Female,Louisiana,55,4/14/2018,3,married,591089
202655,98580,nan,Patterson,Male,Washington,43,3/12/2020,2,married,592409
21726,58596,Thomas,Cohen,Male,Washington,75,5/6/2017,2,married,593901

It appears that some people make oodles of money and these entries are valid. No outliers were found.

## 4. Combine customer data with the remaining prepared Instacart data

In [18]:
# Import remaining prepared Instacart data.

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_agg.pkl'))

In [52]:
# Check ords_prods_merge basic information and column names.

ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int64
 1   user_id                        object
 2   order_number                   int64
 3   orders_day_of_week             int64
 4   order_hour_of_day              int64
 5   days_since_prior_order         float64
 6   product_id                     int64
 7   add_to_cart_order              int64
 8   reordered                      int64
 9   _merge                         category
 10  product_name                   object
 11  aisle_id                       int64
 12  department_id                  int64
 13  prices                         float64
 14  price_range_loc                object
 15  busiest_day                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int64
 19  loyalty_flag                   object
 20  mean_prices                    float64
 21  spending_flag                  object
 22  median_days_since_prior_order  float64
 23  order_frequency_flag           object
dtypes: category(1), float64(4), int64(10), object(9)
memory usage: 5.8+ GB

In [53]:
# Drop the _merge column in ords_prods_merge to prevent future conflict with _merge category.

ords_prods_merge.drop(columns=['_merge'], inplace=True)

In [54]:
# Check to see if _merge column was dropped.

ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int64
 1   user_id                        object
 2   order_number                   int64
 3   orders_day_of_week             int64
 4   order_hour_of_day              int64
 5   days_since_prior_order         float64
 6   product_id                     int64
 7   add_to_cart_order              int64
 8   reordered                      int64
 9   product_name                   object
 10  aisle_id                       int64
 11  department_id                  int64
 12  prices                         float64
 13  price_range_loc                object
 14  busiest_day                    object
 15  busiest_days                   object
 16  busiest_period_of_day          object
 17  max_order                      int64
 18  loyalty_flag                   object
 19  mean_prices                    float64
 20  spending_flag                  object
 21  median_days_since_prior_order  float64
 22  order_frequency_flag           object
dtypes: float64(4), int64(10), object(9)
memory usage: 5.8+ GB

In [55]:
# Merge ords_prods_merge with customers on user_id.

orders_products_all = ords_prods_merge.merge(df_customer, on=['user_id'], indicator=True)

In [56]:
# Export merged orders_products_all dataframe to pickle file.

orders_products_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))